{
  "project": "Drawbook",
  "branchName": "ralph/editor-file-actions-and-cleanup",
  "description": "In-Editor File Actions & Code Cleanup - Add delete/move actions inside the editor and clean up unused code",
  "userStories": [
    {
      "id": "US-001",
      "title": "Delete document from inside the editor",
      "description": "As a user, I want to delete the document I'm currently editing so that I can manage files without navigating back to the dashboard.",
      "acceptanceCriteria": [
        "A delete action is accessible from the EditorShell toolbar in a dropdown/overflow menu",
        "Clicking delete shows a confirmation dialog with the document name",
        "On confirm, the document is soft-deleted via existing DELETE /api/delete/:documentId",
        "After deletion, the user is navigated back to the dashboard",
        "A toast or inline notification confirms the document was moved to trash",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Move document to a different folder from inside the editor",
      "description": "As a user, I want to move the current document to a different folder without leaving the editor so I can organize as I work.",
      "acceptanceCriteria": [
        "A 'Move to...' action is accessible from the EditorShell toolbar dropdown/overflow menu",
        "Clicking it opens a folder picker dialog showing the folder hierarchy",
        "The current folder is visually indicated in the picker",
        "Selecting a folder and confirming moves the document via existing POST /api/documents/:documentId/move",
        "A toast or inline notification confirms the move and shows the destination folder name",
        "The editor stays open on the same document after the move",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Remove unused npm dependencies",
      "description": "As a developer, I want unused npm packages removed so the install is faster and the bundle is smaller.",
      "acceptanceCriteria": [
        "Run depcheck or manual audit to identify unused packages in package.json",
        "Remove all confirmed unused packages from package.json (skip any used via side effects or dynamic imports)",
        "Run npm install to update lockfile",
        "Verify the app builds successfully with npm run build",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Remove dead imports and unused exports in client code",
      "description": "As a developer, I want dead imports and unused exports removed from client source files.",
      "acceptanceCriteria": [
        "Identify and remove unused imports across all files in app/src/",
        "Identify and remove unused exported functions, components, and types in app/src/",
        "No functional changes to the app",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Remove dead imports and unused exports in server code",
      "description": "As a developer, I want dead imports and unused exports removed from server source files.",
      "acceptanceCriteria": [
        "Identify and remove unused imports in app/server/index.ts, app/server/storage.ts, and app/server/ai.ts",
        "Identify and remove unused exported functions and types in server files",
        "No functional changes — all API endpoints behave identically",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Extract document routes from server/index.ts into routes/documents.ts",
      "description": "As a developer, I want document-related routes extracted into their own module for maintainability.",
      "acceptanceCriteria": [
        "Create app/server/routes/documents.ts with an Express Router",
        "Move all document CRUD routes (save, load, list, delete, duplicate, rename, move, star, tags) from server/index.ts to routes/documents.ts",
        "Import and mount the router in server/index.ts",
        "All moved endpoints behave identically (same paths, same request/response format)",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Extract folder and knowledge routes from server/index.ts",
      "description": "As a developer, I want folder, template, fleeting note, and trash routes extracted into their own modules.",
      "acceptanceCriteria": [
        "Create app/server/routes/folders.ts with folder CRUD routes",
        "Create app/server/routes/knowledge.ts with template, fleeting note, daily note, and version routes",
        "Create app/server/routes/trash.ts with trash list, restore, and empty routes",
        "Move corresponding routes from server/index.ts to these new modules",
        "Import and mount all routers in server/index.ts",
        "All moved endpoints behave identically",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Extract search, import, and bulk routes from server/index.ts",
      "description": "As a developer, I want remaining miscellaneous routes extracted so server/index.ts only contains setup and middleware.",
      "acceptanceCriteria": [
        "Create app/server/routes/search.ts with search and backlink/link-graph routes",
        "Create app/server/routes/import.ts with upload, obsidian import, and file download routes",
        "Create app/server/routes/bulk.ts with bulk move and bulk delete routes",
        "Move corresponding routes from server/index.ts to these new modules",
        "server/index.ts now only contains Express setup, middleware, auth, WebSocket, and router mounting",
        "server/index.ts is under 500 lines",
        "All endpoints behave identically",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Consolidate duplicate patterns in route handlers",
      "description": "As a developer, I want repeated error handling and response patterns consolidated into shared helpers.",
      "acceptanceCriteria": [
        "Identify repeated try/catch + error response patterns across route modules",
        "Create shared middleware or helper (e.g. asyncHandler wrapper, standard error response function)",
        "Apply shared patterns to all route modules",
        "Identify and consolidate duplicated client-side API call patterns in app/src/",
        "No functional changes — all endpoints and client behavior identical",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    }
  ]
}
