{
  "project": "Drawbook",
  "branchName": "ralph/ux-polish-round-2",
  "description": "Dashboard UX improvements, quick switcher, document operations, and quality-of-life features",
  "userStories": [
    {
      "id": "US-001",
      "title": "Add document duplicate API endpoint",
      "description": "As a user, I want to duplicate a document so I can create copies without starting from scratch.",
      "acceptanceCriteria": [
        "POST /api/duplicate/:documentId endpoint in app/server/index.ts",
        "Endpoint loads the source document snapshot and metadata",
        "Creates a new document with the same type, snapshot, and folder",
        "New document name is '{original name} (Copy)'",
        "Returns { success: true, documentId: newId, name: newName }",
        "Returns 404 if source document not found",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Follow the pattern of existing endpoints like POST /api/save/:documentId. Use storage.loadDocument, storage.saveDocument, storage.loadDocMeta, storage.saveDocMeta. New ID format: '{type}-{Date.now()}'."
    },
    {
      "id": "US-002",
      "title": "Add duplicate option to dashboard document context menu",
      "description": "As a user, I want to duplicate a document from the dashboard context menu.",
      "acceptanceCriteria": [
        "Document context menu in Dashboard.tsx has a 'Duplicate' option between 'Rename' and 'Move to'",
        "Clicking Duplicate calls POST /api/duplicate/:documentId",
        "After success, the new document appears in the document list without page refresh",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "The context menu is rendered around lines 1650-1750 in Dashboard.tsx. After duplicating, call loadData() to refresh the list."
    },
    {
      "id": "US-003",
      "title": "Add sort options to dashboard document list",
      "description": "As a user, I want to sort documents by name, date, or type so I can find things faster.",
      "acceptanceCriteria": [
        "Sort dropdown or toggle buttons appear in the dashboard toolbar area (near the search bar)",
        "Sort options: 'Modified (newest)', 'Modified (oldest)', 'Name (A-Z)', 'Name (Z-A)', 'Type'",
        "Default sort is 'Modified (newest)' which matches current behavior",
        "Sort preference persists in localStorage key 'drawbook_sort'",
        "Documents re-sort immediately when changing the option",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Currently docs are sorted by modifiedAt descending from the server. Add client-side sorting in the filteredDocs useMemo. Store sort key in state and localStorage."
    },
    {
      "id": "US-004",
      "title": "Add quick switcher dialog (Cmd+K)",
      "description": "As a user, I want a keyboard shortcut to quickly search and open any document.",
      "acceptanceCriteria": [
        "Pressing Cmd+K (Mac) or Ctrl+K (Windows) opens a modal overlay",
        "Modal has a search input that filters all documents by name",
        "Results show document name, type badge, and folder path",
        "Pressing Enter opens the first result; arrow keys navigate results",
        "Pressing Escape closes the modal",
        "Works from both the dashboard and any editor view",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Create a new component app/src/components/QuickSwitcher.tsx. Render it in App.tsx so it's available everywhere. Fetch documents from /api/documents on open. Navigate with window.location.href = '/?doc={id}'."
    },
    {
      "id": "US-005",
      "title": "Add recent documents section to dashboard",
      "description": "As a user, I want to see my recently opened documents for quick access.",
      "acceptanceCriteria": [
        "A 'Recent' section appears at the top of the dashboard when not inside a folder",
        "Shows the last 5 documents opened, as horizontal cards with type icon and name",
        "Recent list is stored in localStorage key 'drawbook_recent' as an array of document IDs",
        "Opening a document adds it to the front of the recent list (deduped, max 10)",
        "Recent section is hidden when searching or inside a subfolder",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Track recent opens in App.tsx or Dashboard.tsx. When navigating to a doc (openDoc function), push the doc ID to localStorage. Display as a horizontal scrollable row of cards."
    },
    {
      "id": "US-006",
      "title": "Add Kanban card detail view with description editing",
      "description": "As a user, I want to click a Kanban card to see and edit its description.",
      "acceptanceCriteria": [
        "Clicking a card title (single click, not double-click) opens a modal/overlay with card details",
        "Modal shows the card title (editable) and description (editable textarea)",
        "Changes save on blur or when closing the modal",
        "Modal has a close button and closes on Escape",
        "Double-click on card title still does inline rename as before",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "KanbanCard already has a description field (line 35 in KanbanEditor.tsx) but it's never shown. Add a KanbanCardDetail modal component. Use the existing updateCard callback to save changes."
    },
    {
      "id": "US-007",
      "title": "Add PDF download button to PdfViewer",
      "description": "As a user, I want to download the PDF file I'm viewing.",
      "acceptanceCriteria": [
        "PdfViewer (app/src/components/PdfViewer.tsx) has a download button in its topbar",
        "Clicking download triggers a browser download of the PDF file",
        "Download uses the document name as the filename",
        "Button has a download icon and tooltip 'Download PDF'",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "The PDF is served from /api/file/:documentId. Create an anchor element with download attribute pointing to that URL. The document name can be fetched from /api/meta/:documentId or passed as a prop."
    },
    {
      "id": "US-008",
      "title": "Add Markdown document export button",
      "description": "As a user, I want to export my Markdown document as a .md file.",
      "acceptanceCriteria": [
        "MarkdownEditor topbar (via EditorShell) has an export/download button",
        "Clicking export downloads the document content as a .md file",
        "File is named after the document title",
        "Export uses the BlockNote editor's markdown conversion",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 8,
      "passes": true,
      "notes": "EditorShell needs to accept an optional onExport callback prop. MarkdownEditor passes a function that calls editor.blocksToMarkdownLossy(editor.document) and triggers a download via Blob + URL.createObjectURL. Add an export button next to the AI toggle in EditorShell."
    }
  ]
}