{
  "project": "Drawbook",
  "branchName": "ralph/integration-round-4",
  "description": "Bug fix, cross-editor integration, import/export, AI improvements, and tool synergy features",
  "userStories": [
    {
      "id": "US-001",
      "title": "Fix star button breaking document row grid layout",
      "description": "As a user, I want the star button to not disrupt the document list layout.",
      "acceptanceCriteria": [
        "The doc-row grid in app/src/index.css includes a dedicated column for the star button (24px) between icon and name",
        "The doc-list__header grid matches with an empty cell for the star column",
        "Both desktop (5-column) and mobile (4-column) responsive grids are updated",
        "Document name displays correctly in its column, not pushed to the right",
        "Star button is properly sized and aligned within its column",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Current grid: 36px 1fr 100px 100px 36px. The star button is an extra grid child between icon and name, pushing everything off. Fix: change to 36px 24px 1fr 100px 100px 36px. Also update the header to have 6 columns with an empty span for the star column. Mobile grid: 28px 24px 1fr 80px 36px."
    },
    {
      "id": "US-002",
      "title": "Add Markdown file import via upload",
      "description": "As a user, I want to import .md files to create Markdown documents.",
      "acceptanceCriteria": [
        "The upload file input in Dashboard.tsx accepts .md files in addition to .pdf",
        "POST /api/upload in app/server/index.ts handles .md files by creating a markdown document with the file content as snapshot",
        "The imported document appears in the dashboard with the original filename as its name",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": true,
      "notes": "Extend the multer upload handler. For .md files, read the text content, create a document with id 'markdown-{timestamp}', save snapshot as { content: fileText }, and save meta with name from filename. Keep existing PDF handling unchanged."
    },
    {
      "id": "US-003",
      "title": "Add CSV import to create Spreadsheet documents",
      "description": "As a user, I want to import CSV files to create Spreadsheet documents.",
      "acceptanceCriteria": [
        "The upload file input in Dashboard.tsx accepts .csv files",
        "POST /api/upload handles .csv by parsing CSV text into a Univer-compatible cell data structure",
        "The imported spreadsheet shows the CSV data in the correct cells",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Parse CSV with simple split logic (split by newline, then by comma). Convert to Univer snapshot format: { sheets: { sheet1: { name: 'Sheet1', cellData: { rowIdx: { colIdx: { v: value } } } } } }. Save as spreadsheet document."
    },
    {
      "id": "US-004",
      "title": "Add Kanban card labels with color chips",
      "description": "As a user, I want to add colored labels to Kanban cards for categorization.",
      "acceptanceCriteria": [
        "KanbanCard interface in KanbanEditor.tsx gains an optional labels field: labels?: string[]",
        "The CardDetailModal shows a label input where users can type a label and press Enter to add it",
        "Labels appear as small colored chips on the card in the board view",
        "Each label gets a deterministic color based on its text (hash to color palette)",
        "Labels can be removed by clicking the X on the chip in the detail modal",
        "Existing cards without labels continue to work",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Use a simple hash function to map label text to one of 8 predefined colors. Display labels as small pills below the card title. In the detail modal, add a text input with Enter-to-add behavior."
    },
    {
      "id": "US-005",
      "title": "Add Kanban export as Markdown",
      "description": "As a user, I want to export my Kanban board as a Markdown document.",
      "acceptanceCriteria": [
        "KanbanEditor passes an onExport callback to EditorShell",
        "Export generates Markdown with columns as ## headings and cards as bullet points with descriptions",
        "The file downloads as {docName}.md",
        "Export button label is 'Export .md'",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "Format: # Board Name\\n\\n## Column Title\\n- Card title\\n  Description text\\n\\n for each column. Use Blob + URL.createObjectURL for download."
    },
    {
      "id": "US-006",
      "title": "Add document tags API and dashboard tag filter",
      "description": "As a user, I want to tag documents and filter by tags in the dashboard.",
      "acceptanceCriteria": [
        "POST /api/documents/:documentId/tags endpoint accepts { tags: string[] } and saves to metadata",
        "GET /api/documents response includes tags array for each document",
        "Dashboard shows a tag filter bar below the header when any documents have tags",
        "Clicking a tag filters to show only documents with that tag",
        "Tags are displayed as small pills on document rows",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": true,
      "notes": "DocMetadata already has tags?: string[]. Add the API endpoint. In Dashboard, collect all unique tags from allDocs, render as clickable filter pills. Add an activeTag state that filters visibleDocs."
    },
    {
      "id": "US-007",
      "title": "Add tag editing in document context menu",
      "description": "As a user, I want to add or edit tags on a document from the context menu.",
      "acceptanceCriteria": [
        "Document context menu in Dashboard.tsx has a 'Tags...' option",
        "Clicking it opens a small inline popover with current tags and an input to add new ones",
        "Tags can be added by typing and pressing Enter",
        "Tags can be removed by clicking the X on each tag pill",
        "Changes are saved immediately via the /api/documents/:documentId/tags endpoint",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Add a TagEditor component that renders inline. Show it when the user clicks 'Tags...' in the context menu. Use a simple text input with Enter handler."
    },
    {
      "id": "US-008",
      "title": "Implement Kanban AI applyContent for adding cards",
      "description": "As a user, I want the AI to be able to add cards to my Kanban board.",
      "acceptanceCriteria": [
        "createKanbanAdapter applyContent in EditorAdapter.ts parses AI response as JSON array of { title, description, column? }",
        "New cards are added to the first column if no column is specified, or to the matching column by title",
        "The /api/ai/chat system prompt for kanban in ai.ts instructs the model to return <kanban-cards>[...]</kanban-cards>",
        "parseAiResponse in ai.ts handles the kanban-cards tag extraction",
        "Invalid JSON is caught without crashing",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Follow the pattern of tldraw applyContent. The adapter needs a setData callback to update the board state. Pass a ref to the setData function from KanbanEditor."
    },
    {
      "id": "US-009",
      "title": "Add AI template generation for new documents",
      "description": "As a user, I want to generate a document from an AI template prompt when creating a new document.",
      "acceptanceCriteria": [
        "The New dropdown in Dashboard.tsx has a 'From AI Template...' option at the bottom",
        "Clicking it shows a modal with a text input for describing the desired document and a type selector",
        "Submitting calls /api/ai/chat with the template prompt and creates a new document with the AI response",
        "Supported types: markdown, kanban",
        "The new document opens after creation",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 9,
      "passes": true,
      "notes": "For markdown: send prompt asking for markdown content, create doc with the response. For kanban: send prompt asking for a board structure as JSON, parse and create. Use existing /api/ai/chat endpoint with a special system prompt."
    },
    {
      "id": "US-010",
      "title": "Add document info panel with metadata display",
      "description": "As a user, I want to see document metadata (created date, type, folder, tags) in a side panel.",
      "acceptanceCriteria": [
        "EditorShell has an info button (i icon) in the topbar next to the export button",
        "Clicking it toggles a small info panel below the topbar showing: document type, created date, last modified, folder path, tags",
        "Info panel fetches data from /api/meta/:documentId",
        "Panel is dismissible by clicking the button again",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 10,
      "passes": true,
      "notes": "Add an infoOpen state to EditorShell. Fetch metadata on open. Display as a compact horizontal bar with key-value pairs. The /api/meta endpoint already exists."
    },
    {
      "id": "US-011",
      "title": "Add keyboard shortcut help dialog",
      "description": "As a user, I want to see available keyboard shortcuts in a help dialog.",
      "acceptanceCriteria": [
        "Pressing ? (question mark) on the dashboard opens a keyboard shortcuts modal",
        "Modal lists: Cmd+K (Quick Switcher), Cmd+N (New Document), ? (This help)",
        "Modal closes on Escape or clicking outside",
        "Modal has a clean, readable layout with shortcut keys styled as kbd elements",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 11,
      "passes": true,
      "notes": "Create a ShortcutsHelp component rendered in Dashboard.tsx. Add a keydown listener for '?' that opens it. Reuse the quick-switcher overlay styling pattern."
    },
    {
      "id": "US-012",
      "title": "Add mind map type filter buttons",
      "description": "As a user, I want to filter the mind map view by document type.",
      "acceptanceCriteria": [
        "MindMapView has a floating toolbar with type filter toggle buttons (All, Markdown, Excalidraw, Draw.io, Spreadsheet, Kanban, tldraw, PDF)",
        "Clicking a type filter shows only documents of that type (and all folders)",
        "The 'All' button resets the filter",
        "Active filter button is visually highlighted",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 12,
      "passes": true,
      "notes": "Add a typeFilter state to MindMapView. Filter the docs prop before passing to the layout. Render filter buttons in a floating bar at the top of the mind map area."
    },
    {
      "id": "US-013",
      "title": "Add Drawio XML export button",
      "description": "As a user, I want to export my Draw.io diagram as an XML file.",
      "acceptanceCriteria": [
        "DrawioEditor passes an onExport callback to EditorShell",
        "Export downloads the current XML content as a .drawio file",
        "File is named after the document title",
        "Export button label is 'Export .drawio'",
        "Typecheck passes"
      ],
      "priority": 13,
      "passes": true,
      "notes": "The XML is stored in xmlRef.current. Use Blob with type 'application/xml' and URL.createObjectURL. Fetch doc name from /api/meta/:documentId."
    }
  ]
}